reference/openfoam/compressible_supersonic_wedge/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// Supersonic wedge/ramp in a trapezoid:
// - L=1, H=0.6
// - Ramp rises to h=0.2 at x=L (≈11.3 deg).
// - Nx=30, Ny=15

vertices
(
    (0    0    0)
    (1    0.2  0)
    (1    0.6  0)
    (0    0.6  0)
    (0    0    0.01)
    (1    0.2  0.01)
    (1    0.6  0.01)
    (0    0.6  0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 15 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }
    ramp
    {
        type wall;
        faces ((0 4 5 1));
    }
    top
    {
        type patch;
        faces ((3 2 6 7));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);

mergePatchPairs ();
