reference/openfoam/compressible_supersonic_wedge/system/probes_all.cfg
type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   200;

fields (U p);

probeLocations
(
    (0.01666666666666667 0.02322222222222222 0)
    (0.05 0.02966666666666667 0)
    (0.08333333333333333 0.03611111111111111 0)
    (0.1166666666666667 0.04255555555555555 0)
    (0.15 0.049 0)
    (0.1833333333333333 0.05544444444444445 0)
    (0.2166666666666667 0.06188888888888889 0)
    (0.25 0.06833333333333333 0)
    (0.2833333333333333 0.07477777777777778 0)
    (0.3166666666666667 0.08122222222222222 0)
    (0.35 0.08766666666666666 0)
    (0.3833333333333334 0.09411111111111112 0)
    (0.4166666666666667 0.1005555555555556 0)
    (0.45 0.107 0)
    (0.4833333333333333 0.1134444444444445 0)
    (0.5166666666666667 0.1198888888888889 0)
    (0.55 0.1263333333333334 0)
    (0.5833333333333334 0.1327777777777778 0)
    (0.6166666666666667 0.1392222222222222 0)
    (0.65 0.1456666666666667 0)
    (0.6833333333333333 0.1521111111111111 0)
    (0.7166666666666667 0.1585555555555556 0)
    (0.75 0.165 0)
    (0.7833333333333333 0.1714444444444445 0)
    (0.8166666666666667 0.1778888888888889 0)
    (0.85 0.1843333333333333 0)
    (0.8833333333333333 0.1907777777777778 0)
    (0.9166666666666666 0.1972222222222222 0)
    (0.95 0.2036666666666667 0)
    (0.9833333333333333 0.2101111111111111 0)
    (0.01666666666666667 0.063 0)
    (0.05 0.06900000000000001 0)
    (0.08333333333333333 0.075 0)
    (0.1166666666666667 0.081 0)
    (0.15 0.08699999999999999 0)
    (0.1833333333333333 0.093 0)
    (0.2166666666666667 0.099 0)
    (0.25 0.105 0)
    (0.2833333333333333 0.111 0)
    (0.3166666666666667 0.117 0)
    (0.35 0.123 0)
    (0.3833333333333334 0.129 0)
    (0.4166666666666667 0.135 0)
    (0.45 0.141 0)
    (0.4833333333333333 0.147 0)
    (0.5166666666666667 0.153 0)
    (0.55 0.159 0)
    (0.5833333333333334 0.165 0)
    (0.6166666666666667 0.171 0)
    (0.65 0.177 0)
    (0.6833333333333333 0.183 0)
    (0.7166666666666667 0.189 0)
    (0.75 0.195 0)
    (0.7833333333333333 0.201 0)
    (0.8166666666666667 0.207 0)
    (0.85 0.213 0)
    (0.8833333333333333 0.219 0)
    (0.9166666666666666 0.225 0)
    (0.95 0.231 0)
    (0.9833333333333333 0.237 0)
    (0.01666666666666667 0.1027777777777778 0)
    (0.05 0.1083333333333333 0)
    (0.08333333333333333 0.1138888888888889 0)
    (0.1166666666666667 0.1194444444444444 0)
    (0.15 0.125 0)
    (0.1833333333333333 0.1305555555555555 0)
    (0.2166666666666667 0.1361111111111111 0)
    (0.25 0.1416666666666667 0)
    (0.2833333333333333 0.1472222222222222 0)
    (0.3166666666666667 0.1527777777777778 0)
    (0.35 0.1583333333333333 0)
    (0.3833333333333334 0.1638888888888889 0)
    (0.4166666666666667 0.1694444444444445 0)
    (0.45 0.175 0)
    (0.4833333333333333 0.1805555555555556 0)
    (0.5166666666666667 0.1861111111111111 0)
    (0.55 0.1916666666666667 0)
    (0.5833333333333334 0.1972222222222222 0)
    (0.6166666666666667 0.2027777777777778 0)
    (0.65 0.2083333333333333 0)
    (0.6833333333333333 0.2138888888888889 0)
    (0.7166666666666667 0.2194444444444444 0)
    (0.75 0.225 0)
    (0.7833333333333333 0.2305555555555556 0)
    (0.8166666666666667 0.2361111111111111 0)
    (0.85 0.2416666666666667 0)
    (0.8833333333333333 0.2472222222222222 0)
    (0.9166666666666666 0.2527777777777778 0)
    (0.95 0.2583333333333333 0)
    (0.9833333333333333 0.2638888888888888 0)
    (0.01666666666666667 0.1425555555555555 0)
    (0.05 0.1476666666666667 0)
    (0.08333333333333333 0.1527777777777778 0)
    (0.1166666666666667 0.1578888888888889 0)
    (0.15 0.163 0)
    (0.1833333333333333 0.1681111111111111 0)
    (0.2166666666666667 0.1732222222222222 0)
    (0.25 0.1783333333333333 0)
    (0.2833333333333333 0.1834444444444444 0)
...
);
